---
type: LinkNode
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# LinkNode

`Autodesk.Revit.DB.LinkNode` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetDocument | 2014 | `public Document GetDocument ()` |
| Property | SymbolId | 2023 | `public ElementId SymbolId { get ; }` |